'''

作用域
就是名称空间，标识符的可见范围
限制在当前的作用域中，对外不可见

分为全局作用域和局部作用域
顶级标识符都是全局的，全局可见
函数或者类内部是局部的，只是局部可见

全局的变量，向内穿透，函数可以看到外部的变量
函数内部的local变量，从外面无法访问，只是内部访问

函数是可以嵌套的

如果局部变量和外层的变量重名，则内部局部变量优先级更高

如果函数中出现了和全局变量名一致的赋值语句，则认为它就是函数的局部变量，需要先赋值才可以引用！否则会报unbound的错误
如果想函数内部引用全局变量而不是定义局部变量则用global关键字声明

全局变量是公用的，一般情况不要修改，尽量使用局部变量



'''

a = 10
def fn():
    print(a)


fn()


def outer():
    o = 65

    def inner():
        o = 97
        print('inner', o, chr(o))
    inner()
    print('outer', o, chr(o))


outer()


z = 100
def fn():
    global z
    z += 10
    print(z)

fn()
